# CurtaingridUseCurveDistV Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurtaingridUseCurveDistV Property
ParameterTypeId Class See Also
---
"Use Curve Distance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurtaingridUseCurveDistV { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtaingridUseCurveDistV As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurtaingridUseCurveDistV {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace